[
  {
    "id": 1,
    "patient_name": "Test Patient y0AP",
    "record_type": "Symptom Analysis",
    "description": "I have a headache and fever for 2 days",
    "language": "English",
    "report_data": {
      "symptoms_summary": "You have been experiencing a headache and a fever for the past two days. These symptoms often occur together when your body is fighting off an illness.",
      "possible_conditions": [
        "Viral Infection (like a cold or the flu)",
        "Sinus Congestion",
        "Dehydration"
      ],
      "severity_level": "Medium",
      "recommendations": [
        "Get plenty of rest to help your body recover.",
        "Drink lots of fluids like water, broth, or herbal tea to stay hydrated.",
        "Consider over-the-counter fever reducers and pain relievers like ibuprofen or acetaminophen, as directed.",
        "Place a cool, damp cloth on your forehead to help ease your headache and fever."
      ],
      "urgent_care_needed": false,
      "when_to_see_doctor": "See a doctor if your fever goes above 103°F (39.4°C), your headache becomes severe and unbearable, you develop a stiff neck or rash, or if your symptoms don't start to improve in the next 2-3 days.",
      "allergy_warnings": [],
      "condition_considerations": "",
      "disclaimer": "This is not a medical diagnosis. Please consult a doctor for proper evaluation.",
      "success": true,
      "error": null
    },
    "date": "2026-01-19",
    "created_at": "2026-01-19T21:52:12.348967"
  },
  {
    "id": 2,
    "patient_name": "Ishan Jharia",
    "record_type": "Symptom Analysis",
    "description": "I have fever what to do ?",
    "language": "English",
    "report_data": {
      "symptoms_summary": "You are experiencing a fever, which means your body temperature is higher than normal. This is a common sign that your body is fighting off an illness, such as a cold or the flu.",
      "possible_conditions": [
        "Common Cold",
        "Flu (Influenza)",
        "Viral Infection",
        "Bacterial Infection"
      ],
      "severity_level": "Low",
      "recommendations": [
        "Get plenty of rest to help your body recover.",
        "Drink lots of fluids like water, broth, or diluted juice to prevent dehydration.",
        "Take over-the-counter fever reducers like acetaminophen or ibuprofen as directed on the package.",
        "Wear light clothing and use a light blanket to stay comfortable and avoid overheating."
      ],
      "urgent_care_needed": false,
      "when_to_see_doctor": "You should see a doctor if your fever is very high (above 103°F or 39.4°C), lasts longer than three days, or is accompanied by a severe headache, stiff neck, rash, or difficulty breathing.",
      "allergy_warnings": [
        "Ensure your resting area is clean and free from dust to avoid triggering allergy symptoms while you recover."
      ],
      "condition_considerations": "",
      "disclaimer": "This is not a medical diagnosis. Please consult a doctor for proper evaluation.",
      "success": true,
      "error": null
    },
    "date": "2026-01-19",
    "created_at": "2026-01-19T21:56:34.904503"
  }
]